/**
 * Сообщения приложения
 *
 * @type {object}
 */
export const ACTION_MESSAGES = {
  SUCCESS_CREATE: "Запись успешно создана",
  SUCCESS_UPDATE: "Данные успешно обновлены",
  FAILED_UPDATE: "Не удалось обновить данные",
  FAILED_UPLOAD_IMAGE: "Неудачная попытка загрузить изображение",
  FIELDS_ERR: "Некорректное значение одного или нескольких полей",
  SEARCH_TEXT_ERR: "Введите ключевое слово",
  DELETE_CONFIRM: "Вы уверены, что хотите удалить элемент?",
  ERROR_DELETE: "Не удалось удалить запись",
  ERROR_CREATE: "Не удалось создать запись",
  FORM_CHANGED_BEFORE_CLOSE:
    "Возможно, на странице есть несохраненные данные. Вы уверены, что хотите закрыть окно?",
  UNDEFINED_ERR: "Произошла неизвестная ошибка",
  UNEXPECTED_ERR: "Произошла неожиданная ошибка",
  TRY_AGAIN: "Попробуйте ещё раз или обратитесь в поддержку",
  LOADING: "Пожалуйста подождите, идёт процесс загрузки",
  LOADING_SESSION: "Пожалуйста подождите, идёт процесс аутоидентификации",
  EMPTY: "Текущий список пуст",
};
